Tekla.Structures.Model.SharingRole
Model sharing user roles.

Tekla.Structures.Model.SharingRole.None
No role assigned.

Tekla.Structures.Model.SharingRole.AccessDenied
Access denied to the model.

Tekla.Structures.Model.SharingRole.Viewer
Model viewer role.

Tekla.Structures.Model.SharingRole.Editor
Model editor role.

Tekla.Structures.Model.SharingRole.ProjectViewer
Project viewer role.

Tekla.Structures.Model.SharingRole.Owner
Model owner role.